In [1]:
import pandas as pd 

df = pd.read_csv("data/hotel_bookings.csv")

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119390 entries, 0 to 119389
Data columns (total 31 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   hotel                           119390 non-null  object
 1   is_canceled                     119390 non-null  int64
 2   lead_time                       119390 non-null  int64
 3   arrival_date_year               119390 non-null  int64
 4   arrival_date_month              119390 non-null  object
 5   arrival_date_week_number        119390 non-null  int64
 6   arrival_date_day_of_month       119390 non-null  int64
 7   stays_in_weekend_nights         119390 non-null  int64
 8   stays_in_week_nights            119390 non-null  int64
 9   adults                          119390 non-null  int64
 10  children                        119386 non-null  float64
 11  babies                          119390 non-null  int64
 12  meal                            119390 non-null  object
 13  country                         118902 non-null  object
 14  market_segment                  119390 non-null  object
 15  distribution_channel            119390 non-null  object
 16  is_repeated_guest               119390 non-null  int64
 17  previous_cancellations          119390 non-null  int64
 18  previous_bookings_not_canceled  119390 non-null  int64
 19  reserved_room_type              119390 non-null  object
 20  assigned_room_type              119390 non-null  object
 21  booking_changes                 119390 non-null  int64
 22  agent                           103050 non-null  float64
 23  company                         6797 non-null    float64
 24  days_in_waiting_list            119390 non-null  int64
 25  customer_type                   119390 non-null  object
 26  adr                             119390 non-null  float64
 27  required_car_parking_spaces     119390 non-null  int64
 28  total_of_special_requests       119390 non-null  int64
 29  reservation_status              119390 non-null  object
 30  reservation_status_date         119390 non-null  object
dtypes: float64(4), int64(16), object(11)
memory usage: 28.2+ MB

In [3]:
df.distribution_channel.value_counts()

distribution_channel
TA/TO        97870
Direct       14645
Corporate     6677
GDS            193
Undefined        5
Name: count, dtype: int64

In [4]:
df.sample(10)

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,booking_changes,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
84281,City Hotel,0,16,2016,February,8,19,1,2,3,...,0,28.0,NaN,0,Transient,118.00,0,1,Check-Out,22/02/16
40152,City Hotel,1,96,2015,July,28,11,2,1,2,...,0,17.0,NaN,0,Transient-Party,94.50,0,0,Canceled,23/06/15
58974,City Hotel,1,210,2016,October,43,19,0,4,2,...,0,9.0,NaN,0,Transient,96.30,0,2,Canceled,25/08/16
78129,City Hotel,0,12,2015,October,41,4,1,0,1,...,0,3.0,NaN,0,Transient-Party,72.00,0,0,Check-Out,5/10/15
80920,City Hotel,1,3,2015,November,48,28,0,1,2,...,1,83.0,NaN,0,Transient,77.60,0,0,No-Show,28/11/15
3896,Resort Hotel,1,72,2016,February,6,6,2,1,2,...,0,NaN,NaN,0,Transient-Party,73.33,0,0,Canceled,19/01/16
10328,Resort Hotel,1,33,2017,February,9,26,2,1,2,...,0,240.0,NaN,0,Transient,48.00,0,0,Canceled,25/01/17
118980,City Hotel,0,48,2017,August,34,24,1,3,2,...,0,9.0,NaN,0,Transient,134.50,0,1,Check-Out,28/08/17
40391,City Hotel,1,2,2015,July,30,23,1,3,1,...,0,1.0,NaN,0,Transient-Party,17.60,0,0,Canceled,21/07/15
48154,City Hotel,1,73,2016,March,12,17,2,3,2,...,1,9.0,NaN,0,Transient-Party,72.12,0,1,Canceled,6/01/16

In [3]:
df['id_reserva'] = range(1, len(df) + 1)

In [6]:
df.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,id_reserva
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,NaN,NaN,0,Transient,0.0,0,0,Check-Out,1/07/15,1
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,NaN,NaN,0,Transient,0.0,0,0,Check-Out,1/07/15,2
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,NaN,NaN,0,Transient,75.0,0,0,Check-Out,2/07/15,3
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,304.0,NaN,0,Transient,75.0,0,0,Check-Out,2/07/15,4
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,240.0,NaN,0,Transient,98.0,0,1,Check-Out,3/07/15,5

In [13]:
df['required_car_parking_spaces'].value_counts()

required_car_parking_spaces
0    111974
1      7383
2        28
3         3
8         2
Name: count, dtype: int64

In [10]:
df_parking = df[df['required_car_parking_spaces'] > 0].copy()
df_parking['servicio_id'] = 1
df_parking['reserva_id'] = df_parking['id_reserva']
df_parking['numero_plazas'] = df_parking['required_car_parking_spaces']
df_parking['precio_unitario'] = 20
df_parking['precio_total'] = (
    df_parking['numero_plazas'] * df_parking['precio_unitario']
)

df_parking = df_parking[
    ['servicio_id', 'reserva_id', 'numero_plazas', 'precio_unitario', 'precio_total']
]
df_parking

        servicio_id  reserva_id  numero_plazas  precio_unitario  precio_total
25                1          26              1               20            20
29                1          30              1               20            20
53                1          54              1               20            20
54                1          55              1               20            20
55                1          56              1               20            20
...             ...         ...            ...              ...           ...
119158            1      119159              1               20            20
119198            1      119199              1               20            20
119236            1      119237              1               20            20
119281            1      119282              1               20            20
119329            1      119330              1               20            20

[7416 rows x 5 columns]

In [14]:
df_parking['numero_plazas'].value_counts()

numero_plazas
1    7383
2      28
3       3
8       2
Name: count, dtype: int64

In [ ]:
#df_parking.to_csv('data\parking.csv', index=False)

<>:1: SyntaxWarning: invalid escape sequence '\p'
<>:1: SyntaxWarning: invalid escape sequence '\p'
C:\Users\maria\AppData\Local\Temp\ipykernel_23384\3459379635.py:1: SyntaxWarning: invalid escape sequence '\p'
  df_parking.to_csv('data\parking.csv', index=False)

In [16]:
df.columns

Index(['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal',
       'country', 'market_segment', 'distribution_channel',
       'is_repeated_guest', 'previous_cancellations',
       'previous_bookings_not_canceled', 'reserved_room_type',
       'assigned_room_type', 'booking_changes', 'agent', 'company',
       'days_in_waiting_list', 'customer_type', 'adr',
       'required_car_parking_spaces', 'total_of_special_requests',
       'reservation_status', 'reservation_status_date', 'id_reserva'],
      dtype='object')

In [14]:
df[['arrival_date_year',
    'arrival_date_month',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal','distribution_channel','reserved_room_type','agent','reservation_status','id_reserva']]

,arrival_date_year,arrival_date_month,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,children,babies,meal,distribution_channel,reserved_room_type,agent,reservation_status,id_reserva
0,2015,July,1,0,0,2,0.0,0,BB,Direct,C,NaN,Check-Out,1
1,2015,July,1,0,0,2,0.0,0,BB,Direct,C,NaN,Check-Out,2
2,2015,July,1,0,1,1,0.0,0,BB,Direct,A,NaN,Check-Out,3
3,2015,July,1,0,1,1,0.0,0,BB,Corporate,A,304.0,Check-Out,4
4,2015,July,1,0,2,2,0.0,0,BB,TA/TO,A,240.0,Check-Out,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,2017,August,30,2,5,2,0.0,0,BB,TA/TO,A,394.0,Check-Out,119386
119386,2017,August,31,2,5,3,0.0,0,BB,TA/TO,E,9.0,Check-Out,119387
119387,2017,August,31,2,5,2,0.0,0,BB,TA/TO,D,9.0,Check-Out,119388
119388,2017,August,31,2,5,2,0.0,0,BB,TA/TO,A,89.0,Check-Out,119389
119389,2017,August,29,2,7,2,0.0,0,HB,TA/TO,A,9.0,Check-Out,119390

In [15]:
df['reserved_room_type'].value_counts()

reserved_room_type
A    85994
D    19201
E     6535
F     2897
G     2094
B     1118
C      932
H      601
P       12
L        6
Name: count, dtype: int64

In [22]:
df['distribution_channel'].value_counts()

distribution_channel
TA/TO        97870
Direct       14645
Corporate     6677
GDS            193
Undefined        5
Name: count, dtype: int64

In [4]:
df_reservas = df[[
    'arrival_date_year',
    'arrival_date_month',
    'arrival_date_day_of_month',
    'stays_in_weekend_nights',
    'stays_in_week_nights',
    'adults',
    'children',
    'babies',
    'meal',
    'distribution_channel',
    'reserved_room_type',
    'agent',
    'reservation_status',
    'id_reserva'
]].copy()

In [5]:
month_map = {
    'January': 1,
    'February': 2,
    'March': 3,
    'April': 4,
    'May': 5,
    'June': 6,
    'July': 7,
    'August': 8,
    'September': 9,
    'October': 10,
    'November': 11,
    'December': 12
}

In [6]:
df_reservas['arrival_date_month'] = df_reservas['arrival_date_month'].map(month_map)

In [7]:
df_reservas['checkin'] = pd.to_datetime({
    'year': df_reservas['arrival_date_year'],
    'month': df_reservas['arrival_date_month'],
    'day': df_reservas['arrival_date_day_of_month']
})

In [8]:
df_reservas['total_nights'] = df_reservas['stays_in_weekend_nights'] + df_reservas['stays_in_week_nights']
df_reservas['checkout'] = df_reservas['checkin'] + pd.to_timedelta(df_reservas['total_nights'], unit='D')

In [9]:
df_reservas

,arrival_date_year,arrival_date_month,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,children,babies,meal,distribution_channel,reserved_room_type,agent,reservation_status,id_reserva,checkin,total_nights,checkout
0,2015,7,1,0,0,2,0.0,0,BB,Direct,C,NaN,Check-Out,1,2015-07-01,0,2015-07-01
1,2015,7,1,0,0,2,0.0,0,BB,Direct,C,NaN,Check-Out,2,2015-07-01,0,2015-07-01
2,2015,7,1,0,1,1,0.0,0,BB,Direct,A,NaN,Check-Out,3,2015-07-01,1,2015-07-02
3,2015,7,1,0,1,1,0.0,0,BB,Corporate,A,304.0,Check-Out,4,2015-07-01,1,2015-07-02
4,2015,7,1,0,2,2,0.0,0,BB,TA/TO,A,240.0,Check-Out,5,2015-07-01,2,2015-07-03
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,2017,8,30,2,5,2,0.0,0,BB,TA/TO,A,394.0,Check-Out,119386,2017-08-30,7,2017-09-06
119386,2017,8,31,2,5,3,0.0,0,BB,TA/TO,E,9.0,Check-Out,119387,2017-08-31,7,2017-09-07
119387,2017,8,31,2,5,2,0.0,0,BB,TA/TO,D,9.0,Check-Out,119388,2017-08-31,7,2017-09-07
119388,2017,8,31,2,5,2,0.0,0,BB,TA/TO,A,89.0,Check-Out,119389,2017-08-31,7,2017-09-07
119389,2017,8,29,2,7,2,0.0,0,HB,TA/TO,A,9.0,Check-Out,119390,2017-08-29,9,2017-09-07

In [10]:
canal_map = {
    'Direct': 1,
    'TA/TO': 2,
    'Corporate': 3,
    'GDS': 4,
    'Otros': 5
}
df_reservas['id_canal'] = df_reservas['distribution_channel'].map(canal_map)

In [11]:
df_reservas.columns

Index(['arrival_date_year', 'arrival_date_month', 'arrival_date_day_of_month',
       'stays_in_weekend_nights', 'stays_in_week_nights', 'adults', 'children',
       'babies', 'meal', 'distribution_channel', 'reserved_room_type', 'agent',
       'reservation_status', 'id_reserva', 'checkin', 'total_nights',
       'checkout', 'id_canal'],
      dtype='object')

In [12]:
print(df_reservas['id_canal'].dtypes)

float64

In [13]:
df_reservas['id_canal'].value_counts(dropna=False)

id_canal
2.0    97870
1.0    14645
3.0     6677
4.0      193
NaN        5
Name: count, dtype: int64

In [14]:
df_reservas['id_canal'] = df_reservas['id_canal'].fillna(5)

df_reservas['id_canal'] = df_reservas['id_canal'].astype(int)

In [16]:
n_reservas = len(df_reservas)
print(n_reservas)

119390

In [17]:
import numpy as np

# Primer paso: todos los IDs del 1 al 1007 (cada cliente al menos una vez)
base_ids = np.arange(1, 1008)  # 1 a 1007 inclusive

# Si hay más reservas que clientes, generamos IDs adicionales aleatorios
restantes = n_reservas - len(base_ids)

if restantes > 0:
    adicionales = np.random.randint(1, 1008, size=restantes)
    all_ids = np.concatenate([base_ids, adicionales])
else:
    all_ids = base_ids

# Mezclamos para que no queden ordenados
np.random.shuffle(all_ids)

# Asignamos al dataframe
df_reservas['id_cliente'] = all_ids[:n_reservas]

In [18]:
df_reservas['id_cliente'].value_counts().head()

id_cliente
479    159
320    149
382    146
789    144
604    144
Name: count, dtype: int64

In [19]:
df_reservas

,arrival_date_year,arrival_date_month,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,children,babies,meal,distribution_channel,reserved_room_type,agent,reservation_status,id_reserva,checkin,total_nights,checkout,id_canal,id_cliente
0,2015,7,1,0,0,2,0.0,0,BB,Direct,C,NaN,Check-Out,1,2015-07-01,0,2015-07-01,1,853
1,2015,7,1,0,0,2,0.0,0,BB,Direct,C,NaN,Check-Out,2,2015-07-01,0,2015-07-01,1,981
2,2015,7,1,0,1,1,0.0,0,BB,Direct,A,NaN,Check-Out,3,2015-07-01,1,2015-07-02,1,933
3,2015,7,1,0,1,1,0.0,0,BB,Corporate,A,304.0,Check-Out,4,2015-07-01,1,2015-07-02,3,934
4,2015,7,1,0,2,2,0.0,0,BB,TA/TO,A,240.0,Check-Out,5,2015-07-01,2,2015-07-03,2,318
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,2017,8,30,2,5,2,0.0,0,BB,TA/TO,A,394.0,Check-Out,119386,2017-08-30,7,2017-09-06,2,852
119386,2017,8,31,2,5,3,0.0,0,BB,TA/TO,E,9.0,Check-Out,119387,2017-08-31,7,2017-09-07,2,461
119387,2017,8,31,2,5,2,0.0,0,BB,TA/TO,D,9.0,Check-Out,119388,2017-08-31,7,2017-09-07,2,817
119388,2017,8,31,2,5,2,0.0,0,BB,TA/TO,A,89.0,Check-Out,119389,2017-08-31,7,2017-09-07,2,311
119389,2017,8,29,2,7,2,0.0,0,HB,TA/TO,A,9.0,Check-Out,119390,2017-08-29,9,2017-09-07,2,625

In [20]:
df_reservas['reserved_room_type'].value_counts()

reserved_room_type
A    85994
D    19201
E     6535
F     2897
G     2094
B     1118
C      932
H      601
P       12
L        6
Name: count, dtype: int64

In [21]:
habitaciones = pd.read_csv('data/habitaciones.csv')

# Crear diccionario: tipo -> lista de IDs
habitaciones_dict = {}
for tipo in habitaciones['tipo'].unique():
    habitaciones_dict[tipo] = list(habitaciones[habitaciones['tipo'] == tipo]['id_habitacion'])

In [22]:
def asignar_tipo_habitacion(row):
    # Suites
    if row['reserved_room_type'].lower() in ['h','p','l']:
        return 'suite'
    
    # Familiares
    elif row['children'] + row['babies'] > 0:
        # Elegimos interior o exterior al azar
        return np.random.choice(['familiar_interior', 'familiar_exterior'])
    
    # Dobles
    elif row['adults'] == 2:
        return np.random.choice(['doble_interior', 'doble_exterior'])
    
    # Individuales
    elif row['adults'] == 1:
        return np.random.choice(['individual_interior', 'individual_exterior'])
    
    else:
        # Default por si hay casos raros
        return 'individual_interior'

In [23]:
# Primero asignamos el tipo
df_reservas['tipo_habitacion'] = df_reservas.apply(asignar_tipo_habitacion, axis=1)

# Ahora asignamos un id_habitacion disponible de ese tipo
def asignar_id_habitacion(tipo):
    return np.random.choice(habitaciones_dict[tipo])

df_reservas['id_habitacion'] = df_reservas['tipo_habitacion'].apply(asignar_id_habitacion)

In [24]:
df_reservas['estado_reserva']=df_reservas['reservation_status']
df_reservas['adultos']=df_reservas['adults']
df_reservas['ninos']=df_reservas['children']
df_reservas['bebes']=df_reservas['babies']
df_reservas['deposito']=df_reservas['agent']

In [25]:
print(df_reservas['ninos'].dtypes)

float64

In [26]:
df_reservas['ninos'].value_counts(dropna=False)

ninos
0.0     110796
1.0       4861
2.0       3652
3.0         76
NaN          4
10.0         1
Name: count, dtype: int64

In [27]:
df_reservas['bebes'].value_counts(dropna=False)

bebes
0     118473
1        900
2         15
10         1
9          1
Name: count, dtype: int64

In [28]:
df_reservas['ninos'] = df_reservas['ninos'].fillna(0).astype(int)

In [29]:
df_reservas['ninos'] = df_reservas['ninos'].astype(int)

In [31]:
df_reservas['deposito'] = df_reservas['deposito'].fillna(0).astype(float)

In [32]:
df_reservas[['adults', 'children',
       'babies', 'agent',
       'reservation_status', 'id_reserva', 'checkin','checkout','id_canal','id_cliente','id_habitacion']]

,adults,children,babies,agent,reservation_status,id_reserva,checkin,checkout,id_canal,id_cliente,id_habitacion
0,2,0.0,0,NaN,Check-Out,1,2015-07-01,2015-07-01,1,853,847
1,2,0.0,0,NaN,Check-Out,2,2015-07-01,2015-07-01,1,981,457
2,1,0.0,0,NaN,Check-Out,3,2015-07-01,2015-07-02,1,933,671
3,1,0.0,0,304.0,Check-Out,4,2015-07-01,2015-07-02,3,934,659
4,2,0.0,0,240.0,Check-Out,5,2015-07-01,2015-07-03,2,318,739
...,...,...,...,...,...,...,...,...,...,...,...
119385,2,0.0,0,394.0,Check-Out,119386,2017-08-30,2017-09-06,2,852,276
119386,3,0.0,0,9.0,Check-Out,119387,2017-08-31,2017-09-07,2,461,820
119387,2,0.0,0,9.0,Check-Out,119388,2017-08-31,2017-09-07,2,817,607
119388,2,0.0,0,89.0,Check-Out,119389,2017-08-31,2017-09-07,2,311,450
119389,2,0.0,0,9.0,Check-Out,119390,2017-08-29,2017-09-07,2,625,961

In [57]:
df_reservas.columns

Index(['arrival_date_year', 'arrival_date_month', 'arrival_date_day_of_month',
       'stays_in_weekend_nights', 'stays_in_week_nights', 'adults', 'children',
       'babies', 'meal', 'distribution_channel', 'reserved_room_type', 'agent',
       'reservation_status', 'id_reserva', 'checkin', 'total_nights',
       'checkout', 'id_canal', 'id_cliente', 'tipo_habitacion',
       'id_habitacion', 'estado_reserva', 'adultos', 'ninos', 'bebes',
       'deposito'],
      dtype='object')

In [33]:
df_reservas_final = df_reservas[[
    'id_reserva',
    'id_cliente',
    'id_habitacion',
    'id_canal',
    'estado_reserva',
    'adultos',
    'ninos',
    'bebes',
    'deposito',
    'checkin',
    'checkout'
]].copy()

In [34]:
df_reservas_final

,id_reserva,id_cliente,id_habitacion,id_canal,estado_reserva,adultos,ninos,bebes,deposito,checkin,checkout
0,1,853,847,1,Check-Out,2,0,0,0.0,2015-07-01,2015-07-01
1,2,981,457,1,Check-Out,2,0,0,0.0,2015-07-01,2015-07-01
2,3,933,671,1,Check-Out,1,0,0,0.0,2015-07-01,2015-07-02
3,4,934,659,3,Check-Out,1,0,0,304.0,2015-07-01,2015-07-02
4,5,318,739,2,Check-Out,2,0,0,240.0,2015-07-01,2015-07-03
...,...,...,...,...,...,...,...,...,...,...,...
119385,119386,852,276,2,Check-Out,2,0,0,394.0,2017-08-30,2017-09-06
119386,119387,461,820,2,Check-Out,3,0,0,9.0,2017-08-31,2017-09-07
119387,119388,817,607,2,Check-Out,2,0,0,9.0,2017-08-31,2017-09-07
119388,119389,311,450,2,Check-Out,2,0,0,89.0,2017-08-31,2017-09-07
119389,119390,625,961,2,Check-Out,2,0,0,9.0,2017-08-29,2017-09-07

In [37]:
df_reservas_final['id_reserva'].duplicated().sum()

0

In [ ]:
#df_reservas_final.to_csv('data/reservas.csv', index=False)

In [23]:
df['meal'].value_counts()

meal
BB           92310
HB           14463
SC           10650
Undefined     1169
FB             798
Name: count, dtype: int64

In [24]:
df[['meal', 'id_reserva']]

       meal  id_reserva
0        BB           1
1        BB           2
2        BB           3
3        BB           4
4        BB           5
...     ...         ...
119385   BB      119386
119386   BB      119387
119387   BB      119388
119388   BB      119389
119389   HB      119390

[119390 rows x 2 columns]

In [4]:
df_comida = df[['meal', 'id_reserva']].copy()
df_comida['servicio_id'] = 2
df_comida['reserva_id'] = df_comida['id_reserva']
df_comida['tipo_comida'] = df_comida['meal']
df_comida['tipo_comida'] = df_comida['tipo_comida'].replace('Undefined', 'SC')

In [6]:
precio_map = {
    'BB': 30,
    'HB': 50,
    'FB': 70,
    'SC': 0
}
df_comida['precio'] = df_comida['meal'].map(precio_map)

In [7]:
df_comida

       meal  id_reserva  servicio_id  reserva_id tipo_comida  precio
0        BB           1            2           1          BB    30.0
1        BB           2            2           2          BB    30.0
2        BB           3            2           3          BB    30.0
3        BB           4            2           4          BB    30.0
4        BB           5            2           5          BB    30.0
...     ...         ...          ...         ...         ...     ...
119385   BB      119386            2      119386          BB    30.0
119386   BB      119387            2      119387          BB    30.0
119387   BB      119388            2      119388          BB    30.0
119388   BB      119389            2      119389          BB    30.0
119389   HB      119390            2      119390          HB    50.0

[119390 rows x 6 columns]

In [8]:
df_comida['tipo_comida'].value_counts()

tipo_comida
BB    92310
HB    14463
SC    11819
FB      798
Name: count, dtype: int64

In [9]:
df_comida= df_comida[
    ['servicio_id', 'reserva_id', 'tipo_comida', 'precio']
]

In [10]:
df_comida

        servicio_id  reserva_id tipo_comida  precio
0                 2           1          BB    30.0
1                 2           2          BB    30.0
2                 2           3          BB    30.0
3                 2           4          BB    30.0
4                 2           5          BB    30.0
...             ...         ...         ...     ...
119385            2      119386          BB    30.0
119386            2      119387          BB    30.0
119387            2      119388          BB    30.0
119388            2      119389          BB    30.0
119389            2      119390          HB    50.0

[119390 rows x 4 columns]

In [11]:
df_comida.to_csv('data\comida.csv', index=False)

<>:1: SyntaxWarning: invalid escape sequence '\c'
<>:1: SyntaxWarning: invalid escape sequence '\c'
C:\Users\maria\AppData\Local\Temp\ipykernel_3984\1033777994.py:1: SyntaxWarning: invalid escape sequence '\c'
  df_comida.to_csv('data\comida.csv', index=False)

In [3]:
conteo = df.country.value_counts()
conteo_1 = conteo[conteo >1000]
conteo_1

country
PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
ITA     3766
IRL     3375
BEL     2342
BRA     2224
NLD     2104
USA     2097
CHE     1730
CN      1279
AUT     1263
SWE     1024
Name: count, dtype: int64

In [4]:
lista_paises = conteo_1.index.tolist()
lista_paises

['PRT',
 'GBR',
 'FRA',
 'ESP',
 'DEU',
 'ITA',
 'IRL',
 'BEL',
 'BRA',
 'NLD',
 'USA',
 'CHE',
 'CN',
 'AUT',
 'SWE']

In [5]:
len(lista_paises)

15

In [6]:
paises = df['country'].unique()
print(paises)

['PRT' 'GBR' 'USA' 'ESP' 'IRL' 'FRA' nan 'ROU' 'NOR' 'OMN' 'ARG' 'POL'
 'DEU' 'BEL' 'CHE' 'CN' 'GRC' 'ITA' 'NLD' 'DNK' 'RUS' 'SWE' 'AUS' 'EST'
 'CZE' 'BRA' 'FIN' 'MOZ' 'BWA' 'LUX' 'SVN' 'ALB' 'IND' 'CHN' 'MEX' 'MAR'
 'UKR' 'SMR' 'LVA' 'PRI' 'SRB' 'CHL' 'AUT' 'BLR' 'LTU' 'TUR' 'ZAF' 'AGO'
 'ISR' 'CYM' 'ZMB' 'CPV' 'ZWE' 'DZA' 'KOR' 'CRI' 'HUN' 'ARE' 'TUN' 'JAM'
 'HRV' 'HKG' 'IRN' 'GEO' 'AND' 'GIB' 'URY' 'JEY' 'CAF' 'CYP' 'COL' 'GGY'
 'KWT' 'NGA' 'MDV' 'VEN' 'SVK' 'FJI' 'KAZ' 'PAK' 'IDN' 'LBN' 'PHL' 'SEN'
 'SYC' 'AZE' 'BHR' 'NZL' 'THA' 'DOM' 'MKD' 'MYS' 'ARM' 'JPN' 'LKA' 'CUB'
 'CMR' 'BIH' 'MUS' 'COM' 'SUR' 'UGA' 'BGR' 'CIV' 'JOR' 'SYR' 'SGP' 'BDI'
 'SAU' 'VNM' 'PLW' 'QAT' 'EGY' 'PER' 'MLT' 'MWI' 'ECU' 'MDG' 'ISL' 'UZB'
 'NPL' 'BHS' 'MAC' 'TGO' 'TWN' 'DJI' 'STP' 'KNA' 'ETH' 'IRQ' 'HND' 'RWA'
 'KHM' 'MCO' 'BGD' 'IMN' 'TJK' 'NIC' 'BEN' 'VGB' 'TZA' 'GAB' 'GHA' 'TMP'
 'GLP' 'KEN' 'LIE' 'GNB' 'MNE' 'UMI' 'MYT' 'FRO' 'MMR' 'PAN' 'BFA' 'LBY'
 'MLI' 'NAM' 'BOL' 'PRY' 'BRB' 'ABW' 'AIA' 'SLV' 'DMA' 'PYF' 'GUY' 'LCA'
 'ATA' 'GTM' 'ASM' 'MRT' 'NCL' 'KIR' 'SDN' 'ATF' 'SLE' 'LAO']

In [7]:
df_clientes = pd.read_csv('data\clientes_2000.csv')

df_clientes.info()

# Separar en nombre y apellido
#df_clientes[['nombre', 'apellidos']] = df_clientes['nombre'].str.split(' ', 1, expand=True)

# Ahora puedes eliminar la columna original si quieres
# df.drop(columns=['nombre'], inplace=True)

# Guardar de nuevo el CSV
#df.to_csv('/mnt/data/clientes_2000_separado.csv', index=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   cliente_id  2000 non-null   int64
 1   nombre      2000 non-null   object
 2   email       2000 non-null   object
 3   pais        2000 non-null   object
dtypes: int64(1), object(3)
memory usage: 62.6+ KB

<>:1: SyntaxWarning: invalid escape sequence '\c'
<>:1: SyntaxWarning: invalid escape sequence '\c'
C:\Users\maria\AppData\Local\Temp\ipykernel_1932\324426924.py:1: SyntaxWarning: invalid escape sequence '\c'
  df_clientes = pd.read_csv('data\clientes_2000.csv')

In [8]:
# Separar en máximo 2 partes: nombre y apellido
split_names = df_clientes['nombre'].str.split(' ', n=1, expand=True)
df_clientes['nombre'] = split_names[0]          # Primer nombre
df_clientes['apellidos'] = split_names[1]       # Todo lo demás como apellido

In [9]:
df_clientes

,cliente_id,nombre,email,pais,apellidos
0,1,Lauren,jenniferscott@atkins-garcia.com,TUR,Chen
1,2,Joseph,lauren07@carr.com,PER,Ross
2,3,Dr.,kinggeorge@yahoo.com,ITA,Katie Stephenson
3,4,Taylor,cory64@kelly.com,SVK,Todd
4,5,Shelley,samantha33@yahoo.com,URY,Lowe
...,...,...,...,...,...
1995,1996,Amber,jordanwilliam@gmail.com,BLR,Thomas
1996,1997,David,mitchellabigail@yahoo.com,TUN,Allen
1997,1998,Jennifer,graycynthia@hotmail.com,MAC,Gardner
1998,1999,Christy,smithlauren@gmail.com,PAN,Jackson
1999,2000,Erin,benjamin29@yahoo.com,LVA,Maxwell

In [10]:
# Reordenar columnas
df_clientes = df_clientes[['cliente_id', 'nombre', 'apellidos', 'email', 'pais']]

In [11]:
df_clientes

,cliente_id,nombre,apellidos,email,pais
0,1,Lauren,Chen,jenniferscott@atkins-garcia.com,TUR
1,2,Joseph,Ross,lauren07@carr.com,PER
2,3,Dr.,Katie Stephenson,kinggeorge@yahoo.com,ITA
3,4,Taylor,Todd,cory64@kelly.com,SVK
4,5,Shelley,Lowe,samantha33@yahoo.com,URY
...,...,...,...,...,...
1995,1996,Amber,Thomas,jordanwilliam@gmail.com,BLR
1996,1997,David,Allen,mitchellabigail@yahoo.com,TUN
1997,1998,Jennifer,Gardner,graycynthia@hotmail.com,MAC
1998,1999,Christy,Jackson,smithlauren@gmail.com,PAN
1999,2000,Erin,Maxwell,benjamin29@yahoo.com,LVA

In [12]:
df_clientes.to_csv('data\clientes_2000_separado.csv', index=False)

<>:1: SyntaxWarning: invalid escape sequence '\c'
<>:1: SyntaxWarning: invalid escape sequence '\c'
C:\Users\maria\AppData\Local\Temp\ipykernel_1932\2819493306.py:1: SyntaxWarning: invalid escape sequence '\c'
  df_clientes.to_csv('data\clientes_2000_separado.csv', index=False)

In [13]:
df_cl = pd.read_csv('data\clientes_2000_separado.csv')

<>:1: SyntaxWarning: invalid escape sequence '\c'
<>:1: SyntaxWarning: invalid escape sequence '\c'
C:\Users\maria\AppData\Local\Temp\ipykernel_1932\3276829453.py:1: SyntaxWarning: invalid escape sequence '\c'
  df_cl = pd.read_csv('data\clientes_2000_separado.csv')

In [14]:
# Crear columna email: nombre.apellidos@gmail.com
df_cl['email'] = (df_cl['nombre'].str.lower() + '.' + df_cl['apellidos'].str.lower() + '@gmail.com')

# Opcional: eliminar espacios y caracteres especiales
#df_cl['email'] = df_cl['email'].str.replace(' ', '', regex=False)

In [15]:
df_cl.sample(10)

      cliente_id    nombre  apellidos                       email pais
788          789     Kiara      Baker       kiara.baker@gmail.com  BGR
1570        1571     Heidi     Miller      heidi.miller@gmail.com  OMN
902          903     Aaron     Turner      aaron.turner@gmail.com  MUS
342          343     Jason     Morgan      jason.morgan@gmail.com  BGD
1953        1954   William      Perez     william.perez@gmail.com  CHL
149          150    Steven        Lee        steven.lee@gmail.com  LBY
307          308  Jennifer    Fleming  jennifer.fleming@gmail.com  HUN
1506        1507   Michael     Castro    michael.castro@gmail.com  PRT
1962        1963     Carol      Smith       carol.smith@gmail.com  GTM
773          774    Teresa  Henderson  teresa.henderson@gmail.com  CIV

In [16]:
import random

In [ ]:
# Diccionario de prefijos por país
#prefijos_paises = {
    'PRT': '+351', 'GBR': '+44', 'FRA': '+33', 'ESP': '+34', 'DEU': '+49',
    'ITA': '+39', 'IRL': '+353', 'BEL': '+32', 'BRA': '+55', 'NLD': '+31',
    'USA': '+1', 'CHE': '+41', 'CN': '+86', 'AUT': '+43', 'SWE': '+46',
    'CHN': '+86', 'POL': '+48', 'ISR': '+972', 'RUS': '+7', 'NOR': '+47',
    'ROU': '+40', 'FIN': '+358', 'DNK': '+45', 'AUS': '+61', 'AGO': '+244',
    'LUX': '+352', 'MAR': '+212', 'TUR': '+90', 'HUN': '+36', 'ARG': '+54',
    'JPN': '+81', 'CZE': '+420', 'IND': '+91', 'KOR': '+82', 'GRC': '+30',
    'DZA': '+213', 'SRB': '+381', 'HRV': '+385', 'MEX': '+52', 'EST': '+372',
    'IRN': '+98', 'LTU': '+370', 'ZAF': '+27', 'BGR': '+359', 'NZL': '+64',
    'COL': '+57', 'UKR': '+380', 'MOZ': '+258', 'CHL': '+56', 'SVK': '+421',
    'THA': '+66', 'SVN': '+386', 'ISL': '+354', 'LVA': '+371', 'ARE': '+971',
    'CYP': '+357', 'TWN': '+886', 'SAU': '+966', 'PHL': '+63', 'TUN': '+216',
    'SGP': '+65', 'IDN': '+62', 'NGA': '+234', 'EGY': '+20', 'URY': '+598',
    'LBN': '+961', 'PER': '+51', 'HKG': '+852', 'MYS': '+60', 'ECU': '+593',
    'VEN': '+58', 'BLR': '+375', 'CPV': '+238', 'GEO': '+995', 'JOR': '+962',
    'KAZ': '+7', 'CRI': '+506', 'GIB': '+350', 'MLT': '+356', 'OMN': '+968',
    'AZE': '+994', 'KWT': '+965', 'MAC': '+853', 'QAT': '+974', 'IRQ': '+964',
    'DOM': '+1', 'PAK': '+92', 'BIH': '+387', 'MDV': '+960', 'BGD': '+880',
    'ALB': '+355', 'PRI': '+1', 'SEN': '+221', 'CMR': '+237', 'MKD': '+389',
    'BOL': '+591', 'PAN': '+507', 'GNB': '+245', 'TJK': '+992', 'VNM': '+84',
    'CUB': '+53', 'ARM': '+374', 'JEY': '+44', 'LBY': '+218', 'AND': '+376',
    'MUS': '+230', 'LKA': '+94', 'CIV': '+225', 'JAM': '+1', 'KEN': '+254',
    'FRO': '+298', 'MNE': '+382', 'TZA': '+255', 'BHR': '+973', 'CAF': '+236',
    'SUR': '+597', 'PRY': '+595', 'BRB': '+1', 'GTM': '+502', 'UZB': '+998',
    'MCO': '+377', 'GAB': '+241', 'GHA': '+233', 'ZWE': '+263', 'ETH': '+251',
    'TMP': '+670', 'LIE': '+423', 'GGY': '+44', 'SYR': '+963', 'BEN': '+229',
    'GLP': '+590', 'SLV': '+503', 'ATA': '+672', 'MYT': '+262', 'ABW': '+297',
    'KHM': '+855', 'LAO': '+856', 'STP': '+239', 'ZMB': '+260', 'MWI': '+265',
    'IMN': '+44', 'COM': '+269', 'TGO': '+228', 'UGA': '+256', 'KNA': '+1',
    'RWA': '+250', 'SYC': '+248'
}

# Función para generar teléfono aleatorio según prefijo
#def generar_telefono(pais):
    prefijo = prefijos_paises.get(pais, '+000')
    numero = ''.join(str(random.randint(0, 9)) for _ in range(9))
    return f"{prefijo} {numero[:3]} {numero[3:6]} {numero[6:]}"

# Crear nueva columna
#df_cl['telefono'] = df_cl['pais'].apply(generar_telefono)

In [ ]:
#df_cl

,cliente_id,nombre,apellidos,email,telefono,pais
0,1,Lauren,Chen,lauren.chen@gmail.com,+90 018 313 428,TUR
1,2,Joseph,Ross,joseph.ross@gmail.com,+51 708 869 551,PER
2,3,Dr.,Katie Stephenson,dr..katie stephenson@gmail.com,+39 553 611 874,ITA
3,4,Taylor,Todd,taylor.todd@gmail.com,+421 413 443 593,SVK
4,5,Shelley,Lowe,shelley.lowe@gmail.com,+598 209 660 236,URY
...,...,...,...,...,...,...
1995,1996,Amber,Thomas,amber.thomas@gmail.com,+375 603 850 540,BLR
1996,1997,David,Allen,david.allen@gmail.com,+216 417 939 528,TUN
1997,1998,Jennifer,Gardner,jennifer.gardner@gmail.com,+853 546 007 552,MAC
1998,1999,Christy,Jackson,christy.jackson@gmail.com,+507 104 751 923,PAN
1999,2000,Erin,Maxwell,erin.maxwell@gmail.com,+371 976 408 915,LVA

In [ ]:
# Reordenar columnas
#df_cl = df_cl[['cliente_id', 'nombre', 'apellidos', 'email', 'telefono','pais']]

In [23]:
df_cl.to_csv('data\clientes.csv', index=False)

<>:1: SyntaxWarning: invalid escape sequence '\c'
<>:1: SyntaxWarning: invalid escape sequence '\c'
C:\Users\maria\AppData\Local\Temp\ipykernel_1932\1999335379.py:1: SyntaxWarning: invalid escape sequence '\c'
  df_cl.to_csv('data\clientes.csv', index=False)

In [1]:
import csv

# Definir tipos y tarifas
tipos_tarifas = [
    ('individual_interior', 80),
    ('individual_exterior', 95),
    ('doble_interior', 110),
    ('doble_exterior', 130),
    ('familiar_interior', 150),
    ('familiar_exterior', 170)
]

# Nombre del archivo CSV a generar
archivo_csv = 'habitaciones.csv'

with open(archivo_csv, mode='w', newline='') as file:
    writer = csv.writer(file)
    writer.writerow(['id_habitacion', 'tipo', 'tarifa'])
    
    # IDs 100 a 989 → repartir tipos
    tipo_index = 0
    for id_hab in range(100, 990):
        tipo, tarifa = tipos_tarifas[tipo_index]
        writer.writerow([id_hab, tipo, tarifa])
        tipo_index = (tipo_index + 1) % len(tipos_tarifas)
    
    # IDs 990 a 999 → suites
    for id_hab in range(990, 1000):
        writer.writerow([id_hab, 'suite', 350])

print(f"Archivo '{archivo_csv}' generado correctamente.")

Archivo 'habitaciones.csv' generado correctamente.